{
  "backend/main.mo": "Main actor for the Gujrat Sweet Mart backend, defining product, order, user profile, and UPI config types with CRUD operations, access control enforcement, delivery approval workflows, and blob storage integration.",
  "backend/migration.mo": "Data migration module that transforms old user profiles (with only a `name` field) into the new schema with `fullName`, `contactNumber`, `email`, `principalId`, and `deliveryApprovalStatus`, while preserving product data.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (delivery dashboard access gate, profile page, delivery approvals admin tab) to their corresponding source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document containing one- to two-sentence summaries of each frontend source file, serving as a reference index for the project's frontend codebase.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for the app's light and dark color themes, including primary, secondary, muted, destructive, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the React app titled 'Gujrat Sweet Mart and Jalpan Gruh', mounting the app into a `#root` div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root application component that sets up TanStack Router with all page routes and renders a sticky navigation header with links for Home, Products, My Orders, Profile, Delivery, Admin, and Cart, conditionally shown based on authentication and role.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Reusable UI component that displays a centered 'Access Denied' message with a shield alert icon, accepting an optional custom message prop.",
  "frontend/src/components/CartItem.tsx": "Cart item component that looks up a product by ID, displays its image, name, quantity (formatted for per-kg or per-piece units), and price, and provides a remove button that clears the cart.",
  "frontend/src/components/CustomerInfoForm.tsx": "A form component for collecting and saving customer delivery information (name, phone, address) that loads existing profile data and toggles between view and edit modes.",
  "frontend/src/components/DeliveryApprovalManagement.tsx": "An admin component that lists pending delivery staff profiles and allows approving or rejecting them by principal ID, with copy-to-clipboard support.",
  "frontend/src/components/DeliveryStaffManagement.tsx": "An admin form component that grants the delivery role to a user by submitting their principal ID.",
  "frontend/src/components/LoginButton.tsx": "A login/logout button component that uses Internet Identity authentication and clears the React Query cache on logout.",
  "frontend/src/components/OrdersManagement.tsx": "An admin component for managing all orders, supporting order status updates, payment status display, and setting estimated delivery times with configurable units.",
  "frontend/src/components/OrderTrackingTimeline.tsx": "A visual timeline component that displays order progress through stages (placed, shipped, out for delivery, delivered) with responsive desktop and mobile layouts, and a cancelled state.",
  "frontend/src/components/PaymentMethodSelector.tsx": "A UI component that lets users select a payment method (Cash on Delivery, UPI, or Card) with highlighted selection state.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product card with category-based styling, weight/quantity selectors, price calculation, and an add-to-cart button that requires authentication.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing a product, handling image upload/preview, field validation, and submitting via add/edit product mutations.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts a newly authenticated user to enter their name and save their profile if none exists yet.",
  "frontend/src/components/SecurityKeyDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/SecurityKeyInput.tsx": "Empty file with no content.",
  "frontend/src/components/StripePaymentSetup.tsx": "Admin component that checks whether Stripe is configured and, if not, provides a form to save a Stripe secret key and allowed countries.",
  "frontend/src/components/UpiPaymentSetup.tsx": "Admin component for configuring UPI payment by entering a UPI ID and uploading a QR code image, with pre-population from existing config.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides a `useIsCallerAdmin` hook that queries the backend to check if the current authenticated user is an admin, with retry logic and verbose debug logging.",
  "frontend/src/hooks/useCart.ts": "Exports hooks for fetching the cart (`useGetCart`), adding items (`useAddToCart`), and clearing the cart (`useClearCart`) via the backend actor.",
  "frontend/src/hooks/useCustomerProfile.ts": "Exports hooks for fetching (`useGetCustomerProfile`) and saving (`useSaveCustomerProfile`) a customer's profile using the backend actor.",
  "frontend/src/hooks/useDeliveryApprovals.ts": "Provides hooks to fetch pending delivery profiles and approve or reject delivery principal access, with toast notifications on success/error.",
  "frontend/src/hooks/useDeliveryOrders.ts": "Exports hooks for fetching active delivery orders (`useGetActiveOrdersForDelivery`) and updating their status (`useUpdateOrderStatusByDelivery`) with toast feedback.",
  "frontend/src/hooks/useDeliveryRole.ts": "Provides hooks to check if the current user is a delivery person (`useIsDeliveryPerson`) and to assign the delivery role to a principal (`useAssignDeliveryRole`).",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useMyProfile.ts": "Exports hooks for fetching (`useMyProfile`) and saving (`useSaveMyProfile`) the current caller's user profile via the backend actor.",
  "frontend/src/hooks/useOrders.ts": "Provides a comprehensive set of order-related hooks including fetching, creating, updating status, cancelling, setting delivery time, and marking orders as paid.",
  "frontend/src/hooks/useProductMutations.ts": "Exports mutation hooks for adding (`useAddProduct`), editing (`useEditProduct`), and deleting (`useDeleteProduct`) products, each invalidating the products query on success.",
  "frontend/src/hooks/useProducts.ts": "Exports a single `useGetAllProducts` hook that fetches all products from the backend actor using React Query.",
  "frontend/src/hooks/useSecurityKey.ts": "Empty file with no content or exports.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides hooks for creating a Stripe checkout session (`useCreateCheckoutSession`), checking Stripe configuration status (`useIsStripeConfigured`), and setting Stripe configuration (`useSetStripeConfiguration`).",
  "frontend/src/hooks/useUpiConfig.ts": "Provides React Query hooks for fetching (`useGetUpiConfig`) and updating (`useSetUpiConfig`) the UPI payment configuration via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching (`useGetCallerUserProfile`) and saving (`useSaveCallerUserProfile`) the current user's profile via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines light/dark CSS custom properties for an Indian-themed color palette (saffron, marigold, deep red), and adds decorative utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query, Internet Identity, and the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with tabs for managing products, orders, UPI/Stripe payment setup, delivery staff, and delivery approvals; guards access by checking admin role.",
  "frontend/src/pages/Cart.tsx": "Cart page that displays the user's cart items with a running total and a button to proceed to checkout; handles unauthenticated and empty-cart states.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that collects customer delivery info, lets the user choose a payment method (COD, UPI, or Stripe card), creates an order, and handles payment flows including UPI instructions and Stripe redirect.",
  "frontend/src/pages/Delivery.tsx": "Delivery personnel dashboard that lists active orders assigned to the logged-in delivery person and allows them to update order status (out for delivery, delivered); guards access by checking delivery role.",
  "frontend/src/pages/Home.tsx": "Landing page for Gujrat Sweet Mart featuring a hero banner, three feature highlights (authentic recipes, fresh daily, wide variety), and a category preview grid with a link to the products page.",
  "frontend/src/pages/MyOrders.tsx": "Displays a logged-in user's order history with status badges, order tracking timelines, and a cancel order flow backed by a confirmation dialog.",
  "frontend/src/pages/OrderConfirmation.tsx": "Shows a post-order confirmation screen with order details, delivery time, and UPI payment instructions (with copy-to-clipboard) for online payment orders.",
  "frontend/src/pages/PaymentFailure.tsx": "Static error page shown when a payment fails, informing the user no charges were made and providing links to go home or return to checkout.",
  "frontend/src/pages/PaymentSuccess.tsx": "Handles post-Stripe-redirect payment verification by checking the session status and marking the order as paid, then displays a success or error state accordingly.",
  "frontend/src/pages/Products.tsx": "Fetches and displays all products grouped by category (sweets, snacks, namkeen, beverages) in responsive grids, with decorative border images between sections.",
  "frontend/src/pages/Profile.tsx": "React page for authenticated users to view and edit their profile (name, contact, email, principal ID) and see their delivery approval status, with a button to request delivery access.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (using oklch variables), fonts, border radii, shadows, and accordion animations for the frontend design system.",
  "project_state.json": "Project state metadata describing a food delivery app on the Internet Computer, tracking existing features around user profiles, delivery role approval flows, admin panels, and React Query hooks."
}