{
  "backend/main.mo": "Main actor for a sweet shop backend on ICP, handling product CRUD, user profiles, shopping cart, orders, and Stripe payment integration with role-based access control for admin and user operations.",
  "backend/migration.mo": "Data migration module that upgrades OldOrder records to NewOrder by adding paymentStatus (defaulting to #pending) and deliveryTime (defaulting to null) fields.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (payment status badges, delivery time admin input, customer-facing delivery time removal, and React Query hooks) to their source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing short descriptions of all frontend source files, serving as a reference index for the project's React components, hooks, pages, and configuration files.",
  "frontend/index.css": "Global CSS file defining Tailwind base styles and OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point for the React app titled 'Gujrat Sweet Mart and Jalpan Gruh' that mounts the app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root application component that sets up TanStack Router with all page routes and renders a sticky header with desktop/mobile navigation including conditional links for authenticated users, admin, cart, and My Orders.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Simple presentational component that displays a centered access-denied message with a shield alert icon for unauthorized page access attempts.",
  "frontend/src/components/CartItem.tsx": "Renders a single cart item card with product image, name, quantity display, and price, and provides a remove button that clears the cart via the useClearCart hook.",
  "frontend/src/components/CustomerInfoForm.tsx": "Form component for collecting and saving customer delivery information (name, phone, address), supporting view and edit modes backed by useGetCustomerProfile and useSaveCustomerProfile hooks.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout.",
  "frontend/src/components/OrdersManagement.tsx": "Admin component for managing all orders, allowing status updates, delivery time configuration, and displaying payment status badges for each order.",
  "frontend/src/components/OrderTrackingTimeline.tsx": "Displays a visual step-by-step order status timeline with desktop and mobile layouts, highlighting completed and current stages, and showing a cancelled state when applicable.",
  "frontend/src/components/PaymentMethodSelector.tsx": "UI component that lets users choose between Cash on Delivery, UPI, and Card payment methods, highlighting the currently selected option.",
  "frontend/src/components/ProductCard.tsx": "Displays a product with category-themed styling, weight or quantity selectors based on unit type, total price calculation, and an add-to-cart button requiring authentication.",
  "frontend/src/components/ProductForm.tsx": "A form component for adding or editing a product, handling fields like name, category, price, unit, and image upload with base64 conversion, using React Query mutations and toast notifications.",
  "frontend/src/components/ProfileSetup.tsx": "A modal dialog that prompts newly authenticated users to enter their name to complete their profile, using the save profile mutation and closing automatically once a profile exists.",
  "frontend/src/components/SecurityKeyDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/SecurityKeyInput.tsx": "Empty file with no content.",
  "frontend/src/components/StripePaymentSetup.tsx": "A settings UI component that checks whether Stripe is already configured and, if not, provides a form to enter a secret key and allowed countries to enable card payments.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAuth.ts": "A hook that queries the backend to determine if the current caller is an admin, with retry logic and verbose debug logging for troubleshooting authentication state.",
  "frontend/src/hooks/useCart.ts": "Provides React Query hooks for fetching the user's cart, adding items to it, and clearing it, all gated on an authenticated actor being available.",
  "frontend/src/hooks/useCustomerProfile.ts": "Provides React Query hooks for fetching and saving the authenticated user's customer profile (name, phone, address) via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity, and status state to the React component tree.",
  "frontend/src/hooks/useOrders.ts": "Provides React Query hooks for order operations including fetching user/all orders, creating orders, updating order status, cancelling orders, and setting delivery time via the backend actor.",
  "frontend/src/hooks/useProductMutations.ts": "Provides React Query mutation hooks for adding, editing, and deleting products via the backend actor, invalidating the 'products' query cache on success.",
  "frontend/src/hooks/useProducts.ts": "Provides a React Query hook to fetch all products from the backend actor, enabled only when the actor is ready.",
  "frontend/src/hooks/useSecurityKey.ts": "Empty file with no content or exports.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides React Query mutation hooks for creating a Stripe checkout session, checking if Stripe is configured, and setting Stripe configuration via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching and saving the current caller's user profile via the backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a warm Indian-themed color palette (saffron, marigold, deep red) as CSS custom properties for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin.tsx": "Admin panel page that allows authenticated admins to manage products (add, edit, delete) and orders via tabbed UI, with Stripe payment setup and access control checks.",
  "frontend/src/pages/Cart.tsx": "Cart page that displays the user's cart items with a running total and a checkout button, handling unauthenticated and empty cart states.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that handles cart review, customer info collection, and payment method selection (cash on delivery, UPI, or Stripe card), creating an order and redirecting accordingly.",
  "frontend/src/pages/Home.tsx": "Landing page for Gujrat Sweet Mart displaying a hero banner, feature highlights (authentic recipes, fresh daily, wide variety), and a product categories preview section.",
  "frontend/src/pages/MyOrders.tsx": "Displays a logged-in user's order history with status badges, delivery time, order tracking timeline, and a cancel order confirmation dialog.",
  "frontend/src/pages/OrderConfirmation.tsx": "Shows a confirmation screen for a specific order by ID, displaying delivery info, payment method, ordered items, and estimated delivery time after a successful order placement.",
  "frontend/src/pages/PaymentFailure.tsx": "Static failure page shown when a Stripe payment is cancelled or fails, with links to return home or retry checkout.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page that verifies the Stripe session status via the backend actor and displays a confirmation message with links to home and order tracking.",
  "frontend/src/pages/Products.tsx": "Displays all products grouped by category (sweets, snacks, namkeen, beverages) in a grid layout with loading and error states. Uses the useGetAllProducts hook and renders ProductCard components for each item.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence helpers. Includes functions to get, store, retrieve, and clear URL/session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH-based color tokens, Inter/Playfair Display fonts, custom border radius, box shadows, and accordion keyframe animations. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project state for an e-commerce platform, listing existing implemented features and pending new feature requests related to payment notifications, delivery time tracking, and admin order management. Serves as a planning document with feature IDs, requirement references, and architectural notes."
}