{
  "backend/main.mo": "Main Motoko actor for the sweet mart backend, defining product, order, user profile, and UPI config types with CRUD operations, access control, delivery assignment, and Stripe/blob-storage integrations.",
  "feature_evidence.json": "Feature evidence report confirming high-confidence implementation of a back button across relevant frontend pages (Products, Cart, Checkout, etc.), excluding the Home page.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing each component, hook, and page's purpose and recent changes for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point for the React app titled 'Gujrat Sweet Mart and Jalpan Gruh', mounting the app at the root div.",
  "frontend/src/App.tsx": "Root app component setting up TanStack Router with all page routes, a sticky navigation header with cart count, admin/delivery role-based links, and a mobile menu.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Reusable component displaying a centered access-denied message with a shield icon for unauthorized page access attempts.",
  "frontend/src/components/BackButton.tsx": "Reusable back button component that calls window.history.back() and is styled with the app's Indian-themed primary color scheme.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product image, name, quantity (with kg/grams/pieces formatting), price, and a remove button that clears the cart.",
  "frontend/src/components/CustomerInfoForm.tsx": "A form component for collecting and saving customer delivery information (name, phone, address) with view/edit toggle states, using React Query hooks for persistence and toast notifications for feedback.",
  "frontend/src/components/DeliveryApprovalManagement.tsx": "An admin component that lists pending delivery personnel profiles and allows approving or rejecting them by principal ID, with copy-to-clipboard support for principal IDs.",
  "frontend/src/components/DeliveryStaffManagement.tsx": "An admin form component that grants the delivery role to a user by accepting their principal ID and calling the assign-delivery-role mutation hook.",
  "frontend/src/components/HomepageConfigForm.tsx": "An admin form for updating homepage configuration including logo image upload (with preview and size validation), business address, hours, and phone number, persisted via a React Query mutation hook.",
  "frontend/src/components/LoginButton.tsx": "A login/logout button component that uses Internet Identity authentication, clearing the React Query cache on logout and handling already-authenticated edge cases.",
  "frontend/src/components/OrdersManagement.tsx": "An admin component for managing all orders, supporting order status updates, delivery time configuration (with value and time-unit selection), and displaying payment status badges for COD and online payments.",
  "frontend/src/components/OrderTrackingTimeline.tsx": "A visual timeline component that displays order progress through stages (placed, shipped, out for delivery, delivered) with responsive desktop and mobile layouts, and a special cancelled state.",
  "frontend/src/components/PaymentMethodSelector.tsx": "React component that renders three payment method options (Cash on Delivery, UPI, Card) as selectable buttons, highlighting the currently selected method.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product with image, name, description, price, and controls for selecting weight or quantity, with an add-to-cart button that requires authentication.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing a product, handling fields like name, category, price, unit, availability, and image upload with base64 conversion.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts newly authenticated users without a profile to enter their name, then saves it via the user profile mutation hook.",
  "frontend/src/components/SecurityKeyDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/SecurityKeyInput.tsx": "Empty file with no content.",
  "frontend/src/components/StripePaymentSetup.tsx": "Admin component for configuring Stripe payments by entering a secret key and allowed countries, showing a success badge if already configured.",
  "frontend/src/components/UpiPaymentSetup.tsx": "Admin component for configuring UPI payments by entering a UPI ID and uploading a QR code image, with pre-population from existing config.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides a `useIsCallerAdmin` hook that queries the backend to check if the current authenticated user is an admin, with retry logic (up to 3 attempts) and verbose debug logging.",
  "frontend/src/hooks/useCart.ts": "Provides hooks for cart operations: fetching the cart (`useGetCart`), adding items (`useAddToCart`), and clearing the cart (`useClearCart`), each backed by React Query and the canister actor.",
  "frontend/src/hooks/useCustomerProfile.ts": "Provides hooks to fetch (`useGetCustomerProfile`) and save (`useSaveCustomerProfile`) a customer's profile via the canister actor, with query invalidation on success.",
  "frontend/src/hooks/useDeliveryApprovals.ts": "Provides hooks to fetch pending delivery profiles and approve or reject delivery principal access, showing toast notifications on success or error.",
  "frontend/src/hooks/useDeliveryOrders.ts": "Provides hooks to fetch active delivery orders (`useGetActiveOrdersForDelivery`) and update their status (`useUpdateOrderStatusByDelivery`) with toast feedback.",
  "frontend/src/hooks/useDeliveryRole.ts": "Provides hooks to check if the current user is a delivery person (`useIsDeliveryPerson`) and to assign the delivery role to a principal (`useAssignDeliveryRole`).",
  "frontend/src/hooks/useHomepageConfig.ts": "Provides hooks to fetch (`useGetHomepageConfig`) and update (`useUpdateHomepageConfig`) the homepage configuration including logo, address, hours, and phone, with toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using `@dfinity/auth-client`, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useMyProfile.ts": "Provides hooks to fetch (`useMyProfile`) and save (`useSaveMyProfile`) the current user's profile, invalidating related queries on successful save.",
  "frontend/src/hooks/useOrders.ts": "Provides a comprehensive set of order-related hooks including fetching user and all orders, creating orders, updating status, cancelling, setting delivery time, and marking as paid.",
  "frontend/src/hooks/useProductMutations.ts": "Provides mutation hooks for product management: adding (`useAddProduct`), editing (`useEditProduct`), and deleting (`useDeleteProduct`) products, each invalidating the products query on success.",
  "frontend/src/hooks/useProducts.ts": "React Query hook to fetch all products from the backend actor, enabled only when the actor is ready.",
  "frontend/src/hooks/useSecurityKey.ts": "Empty file with no content or exports.",
  "frontend/src/hooks/useStripeCheckout.ts": "React Query mutation hooks for creating a Stripe checkout session, checking if Stripe is configured, and setting Stripe configuration via the backend actor.",
  "frontend/src/hooks/useUpiConfig.ts": "React Query hooks to fetch and update UPI payment configuration (UPI ID and QR code) through the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks to fetch the current caller's user profile and save/update it via the backend actor.",
  "frontend/src/index.css": "Global CSS file setting up Tailwind directives and defining a warm Indian-themed color palette (saffron, marigold, deep red) for both light and dark modes using CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/Admin.tsx": "Admin panel page with tabs for managing products, orders, Stripe/UPI payment setup, delivery staff, and homepage config; restricted to authenticated admin users.",
  "frontend/src/pages/Cart.tsx": "Cart page displaying the user's cart items with an order summary and a button to proceed to checkout; requires login.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that collects customer delivery info and payment method (COD, UPI, or Stripe card), creates an order, and handles payment flow including Stripe redirect.",
  "frontend/src/pages/Delivery.tsx": "Delivery dashboard page that shows active orders for delivery personnel, allowing them to mark orders as 'Out for Delivery' or 'Delivered', with access control restricting non-delivery users.",
  "frontend/src/pages/Home.tsx": "Homepage for Gujrat Sweet Mart displaying a hero banner, business info (address, phone, hours) fetched from backend config with fallback defaults, and a link to the products page.",
  "frontend/src/pages/MyOrders.tsx": "User orders page that lists all orders with status badges, order tracking timeline, and the ability to cancel orders that are in 'orderPlaced' or 'shipped' status.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays order details after placement, including items, delivery time, and UPI payment instructions with a copy-to-clipboard UPI ID feature for online orders.",
  "frontend/src/pages/PaymentFailure.tsx": "Static payment failure page shown when a payment is not completed, with links to go home or return to checkout.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page that verifies a Stripe session on load, marks the corresponding order as paid via the backend, and displays success or error states accordingly.",
  "frontend/src/pages/Products.tsx": "Products page that fetches and displays all products grouped by category (sweets, snacks, namkeen, beverages) with search filtering, fuzzy suggestions via Levenshtein distance, and scroll-to-category support via URL params.",
  "frontend/src/pages/Profile.tsx": "User profile page allowing authenticated users to view and edit their name, contact, and email, and displays their delivery approval status badge.",
  "frontend/src/utils/levenshtein.ts": "Provides a Levenshtein edit-distance function and a closestMatch helper that returns the best-matching string from a list of candidates for fuzzy search suggestions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, typography/display font families, border radii, shadows, and accordion animations for the app's Indian-themed design system.",
  "project_state.json": "Project state metadata for Gujarat Sweet Mart tracking schema version, existing features, and a pending feature request to add a back button to relevant pages."
}