{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add back navigation button",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a back button component to relevant pages that navigates to the previous page in browser history, styled with the app's warm Indian-themed design palette",
      "acceptanceCriteria": [
        "A back button is visible at the top-left of the content area on Products, Cart, Checkout, Order Confirmation, My Orders, Profile, Payment Failure, and Payment Success pages.",
        "Clicking the back button navigates the user to the previous page in browser history.",
        "The back button is not shown on the Home page.",
        "The button styling uses the existing saffron/marigold/deep-red color palette and is visually consistent with the rest of the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BackButton.tsx",
          "operation": "create",
          "description": "Create a reusable BackButton component that uses window.history.back() for navigation. Style the button using the warm Indian-themed color palette (saffron/marigold/deep-red) defined in frontend/src/index.css. Include an arrow-left icon and ensure the button is responsive and accessible. Position the button with appropriate margins/padding to sit naturally at the top-left of page content."
        },
        {
          "path": "frontend/src/pages/Products.tsx",
          "operation": "modify",
          "description": "Import and render the BackButton component at the top of the page content area, above the search bar and category sections. Ensure the button is positioned at the top-left with appropriate spacing."
        },
        {
          "path": "frontend/src/pages/Cart.tsx",
          "operation": "modify",
          "description": "Import and render the BackButton component at the top of the cart page content area, above the cart items list. Position it consistently at the top-left with the same spacing used on other pages."
        },
        {
          "path": "frontend/src/pages/Checkout.tsx",
          "operation": "modify",
          "description": "Import and render the BackButton component at the top of the checkout form, before the customer information section. Maintain consistent top-left positioning and spacing."
        },
        {
          "path": "frontend/src/pages/OrderConfirmation.tsx",
          "operation": "modify",
          "description": "Import and render the BackButton component at the top of the order confirmation page, above the order details heading. Use the same positioning pattern as other pages."
        },
        {
          "path": "frontend/src/pages/MyOrders.tsx",
          "operation": "modify",
          "description": "Import and render the BackButton component at the top of the orders list page, before the page heading. Ensure consistent placement at the top-left."
        },
        {
          "path": "frontend/src/pages/Profile.tsx",
          "operation": "modify",
          "description": "Import and render the BackButton component at the top of the profile page, above the profile information section. Maintain the same top-left positioning pattern."
        },
        {
          "path": "frontend/src/pages/PaymentFailure.tsx",
          "operation": "modify",
          "description": "Import and render the BackButton component at the top of the payment failure page, above the failure message. Position it consistently at the top-left."
        },
        {
          "path": "frontend/src/pages/PaymentSuccess.tsx",
          "operation": "modify",
          "description": "Import and render the BackButton component at the top of the payment success page, above the success message and order details. Use the same positioning as other pages."
        }
      ]
    }
  ]
}