{
  "backend/main.mo": "Main backend actor implementing a sweet shop e-commerce system with product management (CRUD operations for sweets/snacks/namkeen), user profile management, and role-based access control using MixinAuthorization for admin and user permissions.",
  "feature_evidence.json": "Feature evidence report documenting two features: verification of useAuth hook's admin status display and console logging in Admin page for debugging access denied issues, both with high confidence.",
  "frontend-file-summaries.txt": "JSON summary of all frontend files describing the Indian-themed sweet shop UI with authentication, admin dashboard, product management, user profiles, and detailed authorization debugging.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining a neutral grayscale palette with accent colors for charts, sidebars, and UI components.",
  "frontend/index.html": "HTML entry point for the Gujrat Sweet Mart and Jalpan Gruh application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, responsive header with navigation (including conditional admin link with shield icon), mobile menu, ProfileSetup modal, and footer layout.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Component displaying an access denied message with shield alert icon for unauthorized users attempting to access restricted pages.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button component with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/ProductCard.tsx": "Reusable product card component displaying product details with category-specific gradient styling and out-of-stock indicator.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding and editing products with validation, toast notifications, loading states, and automatic form reset on successful submission.",
  "frontend/src/components/ProfileSetup.tsx": "Modal component that prompts authenticated users without a profile to enter their name. Automatically opens when user is authenticated but has no profile, and saves the profile on form submission.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication. Handles both anonymous and authenticated actors, initializes access control with admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Hook that checks if the current caller is an admin by querying the backend actor's isCallerAdmin method. Includes extensive debug logging and caches the result for 30 seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Creates and manages AuthClient with configurable options and handles identity persistence across page reloads.",
  "frontend/src/hooks/useProductMutations.ts": "Defines React Query mutations for adding, editing, and deleting products via the backend actor. Each mutation invalidates the products query cache on success.",
  "frontend/src/hooks/useProducts.ts": "React Query hook that fetches all products from the backend actor. Enabled only when actor is available and not fetching.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks for fetching and saving the current user's profile. Includes query for getting caller profile and mutation for saving it, with cache invalidation on save.",
  "frontend/src/index.css": "Tailwind CSS configuration with Indian-themed color scheme using warm creams, saffron, deep reds, and marigold colors. Includes light/dark mode variants and custom decorative pattern utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that checks user admin status and displays product management interface with add/edit/delete functionality. Includes extensive debug logging and shows access denied screen for non-admin users.",
  "frontend/src/pages/Home.tsx": "Homepage component displaying a hero banner with shop name, tagline, and call-to-action button, plus feature cards highlighting authentic recipes, freshness, and variety, and a categories preview section.",
  "frontend/src/pages/Products.tsx": "Products listing page that fetches all products via useGetAllProducts hook, filters them by category (sweets, snacks, namkeen), and displays them in separate sections with decorative borders and category-specific headers.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to store, retrieve, and clear parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended font families (Inter and Playfair Display), custom shadows, animations, and container settings for the Indian-themed design system.",
  "project_state.json": "Project metadata tracking implemented features for an Indian sweets shop website, noting known issues with admin panel authentication and listing features like homepage, product listing, admin interface, and decorative image assets."
}