{
  "backend/main.mo": "Main actor implementing a product catalog system with user profiles, CRUD operations for products (with categories including beverages, unit types, and photo URLs), role-based access control using MixinAuthorization, and migration support.",
  "backend/migration.mo": "Migration module that transforms old product schema (without unit and photoUrl fields) to new schema by adding default values: #single for unit and empty string for photoUrl.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: beverages category addition, beverages display section, unit type selection, unit display on product cards, and photo upload with base64 conversion.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, pages, and configuration files with details about their functionality and implementation.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, including Indian-themed color palette with saffron, marigold, and gold tones.",
  "frontend/index.html": "HTML entry point with page title 'Gujrat Sweet Mart and Jalpan Gruh' and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component with TanStack Router, responsive header with navigation (Home, Products, Admin with shield icon for authenticated users), mobile menu toggle, LoginButton, and ProfileSetup modal integration.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Reusable access denied screen component displaying a shield alert icon and customizable message for unauthorized access attempts.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity authentication button handling login/logout with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, description, price, category, and availability status. Uses gradient backgrounds based on product category and shows unit labels (per kg or per piece).",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, category, description, price, availability, unit, and photo upload. Handles image validation (type and size), base64 conversion, and uses mutations to save product data.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name. Automatically opens when user is authenticated but has no profile, and saves the profile on submission.",
  "frontend/src/components/SecurityKeyDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/SecurityKeyInput.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token from URL params. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides admin authorization check via useIsCallerAdmin hook with extensive debug logging. Returns false for anonymous or missing identity, otherwise calls backend isCallerAdmin method.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout flow and identity persistence. Provides authentication status, identity object, and methods to login and clear identity.",
  "frontend/src/hooks/useProductMutations.ts": "Provides React Query mutations for adding, editing, and deleting products via the backend actor. Each mutation invalidates the products query cache on success.",
  "frontend/src/hooks/useProducts.ts": "React Query hook to fetch all products from the backend actor. Returns empty array if actor is unavailable and is enabled only when actor is ready.",
  "frontend/src/hooks/useSecurityKey.ts": "Empty file with no content.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and save the current user's profile using React Query. Includes loading state management and cache invalidation on profile updates.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm Indian-themed color palette (saffron, marigold, deep red) for both light and dark modes, plus decorative pattern utilities for borders and shadows.",
  "frontend/src/main.tsx": "Application entry point that sets up React with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with authentication checks, product management (CRUD operations), and extensive debug tooling for troubleshooting admin access issues. Includes ProductForm for adding/editing products and displays all products with edit/delete actions.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero banner for \"Gujrat Sweet Mart and Jalpan Gruh\", three feature cards highlighting authentic recipes/fresh ingredients/variety, and a categories preview section with links to product pages.",
  "frontend/src/pages/Products.tsx": "Products catalog page that fetches and displays all products grouped by category (sweets, snacks, namkeen, beverages) with decorative borders between sections and category-specific hero images.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar/chart colors, custom fonts (Inter, Playfair Display), and accordion animations.",
  "project_state.json": "Project state tracking document for an Indian sweets shop website with admin panel, noting simplified first-login-becomes-admin authentication and known issues with admin panel implementation in previous builds."
}