{
  "backend/main.mo": "Main backend actor implementing product management (CRUD operations for sweets/snacks/namkeen) and user profile management with role-based access control using MixinAuthorization; admin-only operations for product management, public queries for product viewing.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: fixing admin authorization logic in Admin.tsx to resolve access denied errors, and adding comprehensive error logging in useAuth hook for admin check queries.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration files for the sweet shop application with Indian theming and admin functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining Indian-themed color palette for backgrounds, foregrounds, borders, and UI elements.",
  "frontend/index.html": "HTML entry point for the application with title 'Gujrat Sweet Mart and Jalpan Gruh' and root div for React mounting.",
  "frontend/src/App.tsx": "Main application component with TanStack Router setup, responsive navigation header with conditional admin link (shown to authenticated users with shield icon), mobile menu, ProfileSetup modal, and footer layout.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Reusable access denied screen component displaying a shield alert icon and customizable message for unauthorized access attempts.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity authentication button component handling login/logout with loading states, query cache clearing on logout, and error handling for duplicate authentication attempts.",
  "frontend/src/components/ProductCard.tsx": "Product display card component with category-specific gradient styling, showing product name, description, price in rupees, availability status, and category label.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding and editing products with validation, category selection, price input, availability toggle, toast notifications, and automatic form reset on successful submission.",
  "frontend/src/components/ProfileSetup.tsx": "Modal component that prompts authenticated users without a profile to enter their name. Automatically opens when user is logged in but has no profile, and saves the profile using a mutation hook.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication. Initializes access control with admin token from URL params and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Hook that checks if the current caller is an admin by calling the backend's isCallerAdmin method. Returns a cached boolean result with 30-second stale time.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages auth client creation, identity persistence, and login status state throughout the application.",
  "frontend/src/hooks/useProductMutations.ts": "Provides React Query mutations for adding, editing, and deleting products. Each mutation invalidates the products query cache on success.",
  "frontend/src/hooks/useProducts.ts": "React Query hook that fetches all products from the backend actor. Enabled only when actor is available and not fetching.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks for fetching and saving the current user's profile. Includes query for getting caller profile and mutation for saving with cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with Indian-themed color palette using warm creams, saffron, deep reds, and marigold colors. Includes light/dark mode variables and custom decorative pattern utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrappers around the main App component.",
  "frontend/src/pages/Admin.tsx": "Admin panel page that checks user authentication and admin status before displaying product management interface. Shows loading states, access denied screen, or product CRUD interface with add/edit/delete functionality.",
  "frontend/src/pages/Home.tsx": "Homepage component displaying a hero banner with shop name, features section highlighting authentic recipes/fresh ingredients/variety, and category preview cards for Sweets, Snacks, and Namkeen with navigation to products page.",
  "frontend/src/pages/Products.tsx": "Products listing page that fetches all products via useGetAllProducts hook, filters them by category (sweets, snacks, namkeen), and displays each category section with ProductCard components and decorative borders.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography with Inter and Playfair Display fonts, custom shadows including paisley effect, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata tracking implemented features for an Indian sweets shop website, with a known issue that the admin panel displays 'Access Denied' instead of the management interface despite authentication being implemented."
}